{"class_name": "Sequential", "config": {"name": "Decoder_128", "layers": [{"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 1, 128]}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_6", "trainable": true, "dtype": "float32", "size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_7", "trainable": true, "dtype": "float32", "size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_7", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2, 2], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_8", "trainable": true, "dtype": "float32", "size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_8", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}], "build_input_shape": [null, 128]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}