{"class_name": "Sequential", "config": {"name": "Decoder_64", "layers": [{"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 1, 64]}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_3", "trainable": true, "dtype": "float32", "size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_4", "trainable": true, "dtype": "float32", "size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_4", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2, 2], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_5", "trainable": true, "dtype": "float32", "size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_5", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}], "build_input_shape": [null, 64]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}